load-testing/server/ingest.speed.04T.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Ingest Speed Test - 4 Threads">
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="ldes_definition" elementType="Argument">
            <stringProp name="Argument.name">ldes_definition</stringProp>
            <stringProp name="Argument.value">@prefix ldes: &lt;https://w3id.org/ldes#&gt; . @prefix tree: &lt;https://w3id.org/tree#&gt;. @prefix dcterms: &lt;http://purl.org/dc/terms/&gt; . @prefix prov: &lt;http://www.w3.org/ns/prov#&gt; . @prefix sh: &lt;http://www.w3.org/ns/shacl#&gt; . &lt;/observations&gt; a ldes:EventStream ; tree:shape [ a sh:NodeShape ] ; ldes:timestampPath prov:generatedAtTime ; ldes:versionOfPath dcterms:isVersionOf .</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="view_definition" elementType="Argument">
            <stringProp name="Argument.name">view_definition</stringProp>
            <stringProp name="Argument.value">@prefix tree: &lt;https://w3id.org/tree#&gt;. @prefix xsd: &lt;http://www.w3.org/2001/XMLSchema#&gt; . @prefix ldes: &lt;https://w3id.org/ldes#&gt; . &lt;/observations/by-page&gt; a tree:Node ; tree:viewDescription [ a tree:ViewDescription ; tree:fragmentationStrategy () ; tree:pageSize &quot;250&quot;^^xsd:integer ; ldes:retentionPolicy [ a ldes:DurationAgoPolicy ; tree:value &quot;P2Y&quot;^^xsd:duration ] ; ] .</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="member" elementType="Argument">
            <stringProp name="Argument.name">member</stringProp>
            <stringProp name="Argument.value">_:Bb9083862X2Db7c5X2D4cf8X2Dbc2bX2D2f15f4c9b1f0 &lt;http://purl.org/dc/terms/type&gt; &lt;https://data.vlaanderen.be/doc/concept/VkmMeetInstrumentType/TODO&gt; . _:Bb9083862X2Db7c5X2D4cf8X2Dbc2bX2D2f15f4c9b1f0 &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#type&gt; &lt;http://www.w3.org/ns/sosa/sensor&gt; . _:Bbb673069X2Dac82X2D4b57X2D964aX2D0dc17e808899 &lt;http://www.opengis.net/ont/geosparql#asWKT&gt; &quot;POINT(3.443384828630522E0 5.107680366717121E1)&quot;^^&lt;http://www.opengis.net/ont/geosparql#wktLiteral&gt; . _:Bbb673069X2Dac82X2D4b57X2D964aX2D0dc17e808899 &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#type&gt; &lt;http://www.opengis.net/ont/sf#Point&gt; . _:B0571e676X2Dde36X2D44c2X2D95c7X2Dcd36ce2a5c76 &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#type&gt; &lt;https://implementatie.data.vlaanderen.be/ns/vsds-verkeersmetingen#Verkeerssnelheidsmetingkenmerk&gt; . _:B0571e676X2Dde36X2D44c2X2D95c7X2Dcd36ce2a5c76 &lt;https://implementatie.data.vlaanderen.be/ns/vsds-verkeersmetingen#Verkeerssnelheidsmetingkenmerk.kenmerktype&gt; &lt;https://data.vlaanderen.be/doc/concept/VkmVerkeersKenmerkType/plaatsgemiddelde_snelheid&gt; . _:B0571e676X2Dde36X2D44c2X2D95c7X2Dcd36ce2a5c76 &lt;https://data.vlaanderen.be/ns/verkeersmetingen#voertuigType&gt; &lt;https://data.vlaanderen.be/doc/concept/VkmVoertuigType/vrachtwagen&gt; . _:B8c72dc9dX2D8331X2D4a7aX2Dab29X2Ded898d9b2a6b &lt;https://implementatie.data.vlaanderen.be/ns/vsds-verkeersmetingen#Verkeersmeetpunt.verkeersmeetpuntnetwerkreferentie&gt; _:Bd7dcbefcX2Dcbc1X2D433eX2Dae43X2D968b193b225a . _:B8c72dc9dX2D8331X2D4a7aX2Dab29X2Ded898d9b2a6b &lt;http://def.isotc211.org/iso19156/2011/SamplingPoint#SF_SamplingPoint.shape&gt; _:Ba638f941X2De4bdX2D4637X2D8de4X2De6aaed734611 . _:B8c72dc9dX2D8331X2D4a7aX2Dab29X2Ded898d9b2a6b &lt;https://data.vlaanderen.be/ns/verkeersmetingen#bemonsterdObject&gt; _:B670d2e0dX2D120bX2D450cX2D9768X2Db727201537e5 . _:B8c72dc9dX2D8331X2D4a7aX2Dab29X2Ded898d9b2a6b &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#type&gt; &lt;https://data.vlaanderen.be/ns/verkeersmetingen#Verkeersmeetpunt&gt; . &lt;https://verkeerscentrum.be/id/verkeerstellingen/${observation}/truck-velocity#2024-01-01T00:00:00+01:00&gt; &lt;http://purl.org/dc/terms/isVersionOf&gt; &lt;https://verkeerscentrum.be/id/verkeerstellingen/${observation}/truck-velocity&gt; . &lt;https://verkeerscentrum.be/id/verkeerstellingen/${observation}/truck-velocity#2024-01-01T00:00:00+01:00&gt; &lt;http://www.w3.org/ns/prov#generatedAtTime&gt; &quot;2024-01-01T00:00:00+01:00&quot;^^&lt;http://www.w3.org/2001/XMLSchema#dateTime&gt; . &lt;https://verkeerscentrum.be/id/verkeerstellingen/${observation}/truck-velocity#2024-01-01T00:00:00+01:00&gt; &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#type&gt; &lt;https://data.vlaanderen.be/ns/verkeersmetingen#Verkeersmeting&gt; . &lt;https://verkeerscentrum.be/id/verkeerstellingen/${observation}/truck-velocity#2024-01-01T00:00:00+01:00&gt; &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#type&gt; &lt;https://implementatie.data.vlaanderen.be/ns/vsds-verkeersmetingen#Verkeerssnelheidsmeting&gt; . &lt;https://verkeerscentrum.be/id/verkeerstellingen/${observation}/truck-velocity#2024-01-01T00:00:00+01:00&gt; &lt;http://def.isotc211.org/iso19156/2011/Observation#OM_Observation.phenomenonTime&gt; _:B5600cc26X2D54d4X2D4da0X2D9a98X2D95fcddd43660 . &lt;https://verkeerscentrum.be/id/verkeerstellingen/${observation}/truck-velocity#2024-01-01T00:00:00+01:00&gt; &lt;http://def.isotc211.org/iso19156/2011/Observation#OM_Observation.result&gt; _:B6e9be13cX2D9147X2D458dX2DbfcfX2D2d489eefcf76 . &lt;https://verkeerscentrum.be/id/verkeerstellingen/${observation}/truck-velocity#2024-01-01T00:00:00+01:00&gt; &lt;https://implementatie.data.vlaanderen.be/ns/vsds-verkeersmetingen#Verkeerssnelheidsmeting.geobserveerdKenmerk&gt; _:B0571e676X2Dde36X2D44c2X2D95c7X2Dcd36ce2a5c76 . &lt;https://verkeerscentrum.be/id/verkeerstellingen/${observation}/truck-velocity#2024-01-01T00:00:00+01:00&gt; &lt;https://data.vlaanderen.be/ns/verkeersmetingen#geobserveerdObject&gt; _:B8c72dc9dX2D8331X2D4a7aX2Dab29X2Ded898d9b2a6b . &lt;https://verkeerscentrum.be/id/verkeerstellingen/${observation}/truck-velocity#2024-01-01T00:00:00+01:00&gt; &lt;http://www.w3.org/ns/sosa/madeBySensor&gt; _:Bb9083862X2Db7c5X2D4cf8X2Dbc2bX2D2f15f4c9b1f0 . _:Ba341716fX2D7ba3X2D4fdeX2Db87aX2De8b67dd67103 &lt;http://www.opengis.net/ont/geosparql#asWKT&gt; &quot;LINESTRING (3.444080404972583 51.07601791071558, 3.443520053954542 51.07671482653927, 3.443384828630522 51.07680366717121)&quot;^^&lt;http://www.opengis.net/ont/geosparql#wktLiteral&gt; . _:Ba341716fX2D7ba3X2D4fdeX2Db87aX2De8b67dd67103 &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#type&gt; &lt;http://www.opengis.net/ont/sf#LineString&gt; . _:Bd7dcbefcX2Dcbc1X2D433eX2Dae43X2D968b193b225a &lt;https://data.vlaanderen.be/ns/netwerk#Puntreferentie.opPositie&gt; _:B688b284cX2D1664X2D427fX2D9a97X2D1730d07da455 . _:Bd7dcbefcX2Dcbc1X2D433eX2Dae43X2D968b193b225a &lt;https://data.vlaanderen.be/ns/netwerk#toepassingsRichting&gt; &lt;https://inspire.ec.europa.eu/codelist/LinkDirectionValue/bothDirection&gt; . _:Bd7dcbefcX2Dcbc1X2D433eX2Dae43X2D968b193b225a &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#type&gt; &lt;https://data.vlaanderen.be/ns/netwerk#Puntreferentie&gt; . _:B0fa893e8X2D0570X2D4735X2Da516X2Dfbb10baeb794 &lt;https://data.vlaanderen.be/ns/netwerk#Knoop.geometrie&gt; _:Bbb673069X2Dac82X2D4b57X2D964aX2D0dc17e808899 . _:B0fa893e8X2D0570X2D4735X2Da516X2Dfbb10baeb794 &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#type&gt; &lt;https://data.vlaanderen.be/ns/weg#Wegknoop&gt; . _:B688b284cX2D1664X2D427fX2D9a97X2D1730d07da455 &lt;https://schema.org/value&gt; &quot;14&quot;^^&lt;http://www.w3.org/2001/XMLSchema#integer&gt; . _:B688b284cX2D1664X2D427fX2D9a97X2D1730d07da455 &lt;https://schema.org/unitCode&gt; &quot;m&quot;^^&lt;https://w3id.org/cdt/ucumunit&gt; . _:B688b284cX2D1664X2D427fX2D9a97X2D1730d07da455 &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#type&gt; &lt;http://def.isotc211.org/iso19103/2015/MeasureTypes#Length&gt; . _:Bad35d6b6X2D8e71X2D4baeX2D91c4X2D1d51a27edf87 &lt;https://data.vlaanderen.be/ns/netwerk#Knoop.geometrie&gt; _:Bc2ee294dX2Dbc57X2D42ddX2Da2eaX2Df355eb567ace . _:Bad35d6b6X2D8e71X2D4baeX2D91c4X2D1d51a27edf87 &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#type&gt; &lt;https://data.vlaanderen.be/ns/weg#Wegknoop&gt; . _:Be11d58e9X2Dda3aX2D4691X2Dbd28X2Da86b0c2327fa &lt;http://www.w3.org/2006/time#inXSDDateTimeStamp&gt; &quot;2024-01-01T00:00:00+01:00&quot;^^&lt;http://www.w3.org/2001/XMLSchema#dateTime&gt; . _:Be11d58e9X2Dda3aX2D4691X2Dbd28X2Da86b0c2327fa &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#type&gt; &lt;http://www.w3.org/2006/time#Instant&gt; . _:B6e9be13cX2D9147X2D458dX2DbfcfX2D2d489eefcf76 &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#type&gt; &lt;http://def.isotc211.org/iso19103/2015/MeasureTypes#Speed&gt; . _:B6e9be13cX2D9147X2D458dX2DbfcfX2D2d489eefcf76 &lt;https://schema.org/unitCode&gt; &quot;km/h&quot;^^&lt;https://w3id.org/cdt/ucumunit&gt; . _:B6e9be13cX2D9147X2D458dX2DbfcfX2D2d489eefcf76 &lt;https://schema.org/value&gt; &quot;62&quot;^^&lt;http://www.w3.org/2001/XMLSchema#integer&gt; . _:Bc2ee294dX2Dbc57X2D42ddX2Da2eaX2Df355eb567ace &lt;http://www.opengis.net/ont/geosparql#asWKT&gt; &quot;POINT(3.444080404972583E0 5.107601791071558E1)&quot;^^&lt;http://www.opengis.net/ont/geosparql#wktLiteral&gt; . _:Bc2ee294dX2Dbc57X2D42ddX2Da2eaX2Df355eb567ace &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#type&gt; &lt;http://www.opengis.net/ont/sf#Point&gt; . _:B5600cc26X2D54d4X2D4da0X2D9a98X2D95fcddd43660 &lt;http://www.w3.org/2006/time#hasXSDDuration&gt; &quot;PT15M&quot;^^&lt;http://www.w3.org/2001/XMLSchema#duration&gt; . _:B5600cc26X2D54d4X2D4da0X2D9a98X2D95fcddd43660 &lt;http://www.w3.org/2006/time#hasBeginning&gt; _:Be11d58e9X2Dda3aX2D4691X2Dbd28X2Da86b0c2327fa . _:B5600cc26X2D54d4X2D4da0X2D9a98X2D95fcddd43660 &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#type&gt; &lt;http://www.w3.org/2006/time#TemporalEntity&gt; . _:B670d2e0dX2D120bX2D450cX2D9768X2Db727201537e5 &lt;https://data.vlaanderen.be/ns/weg#rijrichting&gt; &lt;https://inspire.ec.europa.eu/codelist/LinkDirectionValue/inDirection&gt; . _:B670d2e0dX2D120bX2D450cX2D9768X2Db727201537e5 &lt;https://implementatie.data.vlaanderen.be/ns/vsds-verkeersmetingen#Rijrichting.netwerkreferentieelement&gt; _:B56e84f09X2D89aeX2D4f0fX2Dbd18X2D80ec0e031082 . _:B670d2e0dX2D120bX2D450cX2D9768X2Db727201537e5 &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#type&gt; &lt;https://data.vlaanderen.be/ns/weg#Rijrichting&gt; . _:Ba638f941X2De4bdX2D4637X2D8de4X2De6aaed734611 &lt;http://www.opengis.net/ont/geosparql#asWKT&gt; &quot;POINT(3.443520053954542E0 5.107671482653927E1)&quot;^^&lt;http://www.opengis.net/ont/geosparql#wktLiteral&gt; . _:Ba638f941X2De4bdX2D4637X2D8de4X2De6aaed734611 &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#type&gt; &lt;http://www.opengis.net/ont/sf#Point&gt; . _:B56e84f09X2D89aeX2D4f0fX2Dbd18X2D80ec0e031082 &lt;https://data.vlaanderen.be/ns/netwerk#Link.geometriemiddellijn&gt; _:Ba341716fX2D7ba3X2D4fdeX2Db87aX2De8b67dd67103 . _:B56e84f09X2D89aeX2D4f0fX2Dbd18X2D80ec0e031082 &lt;https://data.vlaanderen.be/ns/netwerk#eindknoop&gt; _:B0fa893e8X2D0570X2D4735X2Da516X2Dfbb10baeb794 . _:B56e84f09X2D89aeX2D4f0fX2Dbd18X2D80ec0e031082 &lt;https://data.vlaanderen.be/ns/netwerk#beginknoop&gt; _:Bad35d6b6X2D8e71X2D4baeX2D91c4X2D1d51a27edf87 . _:B56e84f09X2D89aeX2D4f0fX2Dbd18X2D80ec0e031082 &lt;http://www.w3.org/1999/02/22-rdf-syntax-ns#type&gt; &lt;https://data.vlaanderen.be/ns/weg#Wegsegment&gt; .</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="hostname" elementType="Argument">
            <stringProp name="Argument.name">hostname</stringProp>
            <stringProp name="Argument.value">ldes-server</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="port" elementType="Argument">
            <stringProp name="Argument.name">port</stringProp>
            <stringProp name="Argument.value">8080</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="threads" elementType="Argument">
            <stringProp name="Argument.name">threads</stringProp>
            <stringProp name="Argument.value">4</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="loops" elementType="Argument">
            <stringProp name="Argument.name">loops</stringProp>
            <stringProp name="Argument.value">75000</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="total_count" elementType="Argument">
            <stringProp name="Argument.name">total_count</stringProp>
            <stringProp name="Argument.value">300K</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <intProp name="HTTPSampler.connect_timeout">3000</intProp>
        <intProp name="HTTPSampler.response_timeout">5000</intProp>
        <stringProp name="HTTPSampler.domain">${hostname}</stringProp>
        <stringProp name="HTTPSampler.port">${port}</stringProp>
        <stringProp name="HTTPSampler.contentEncoding">utf8</stringProp>
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="Setup" enabled="true">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </SetupThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">text/turtle</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Setup - Create LDES" enabled="true">
          <stringProp name="HTTPSampler.path">/admin/api/v1/eventstreams</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${ldes_definition}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Setup - Create by-page View" enabled="true">
          <stringProp name="HTTPSampler.path">/admin/api/v1/eventstreams/observations/views</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${view_definition}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Test">
        <boolProp name="ThreadGroup.delayedStart">true</boolProp>
        <stringProp name="ThreadGroup.num_threads">${threads}</stringProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <longProp name="ThreadGroup.duration">600</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${loops}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults">
          <intProp name="HTTPSampler.connect_timeout">3000</intProp>
          <intProp name="HTTPSampler.response_timeout">3000</intProp>
          <stringProp name="HTTPSampler.domain">${hostname}</stringProp>
          <stringProp name="HTTPSampler.port">${port}</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">utf8</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/n-triples</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="Counter" enabled="true">
          <stringProp name="CounterConfig.start">1</stringProp>
          <stringProp name="CounterConfig.incr">1</stringProp>
          <stringProp name="CounterConfig.name">observation</stringProp>
          <boolProp name="CounterConfig.per_user">false</boolProp>
        </CounterConfig>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Test - Send ${total_count} members (${threads}T)" enabled="true">
          <intProp name="HTTPSampler.concurrentPool">6</intProp>
          <stringProp name="HTTPSampler.path">/observations</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${__eval(${member})}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
      <PostThreadGroup guiclass="PostThreadGroupGui" testclass="PostThreadGroup" testname="Tear Down" enabled="true">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">1</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </PostThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Tear Down - Delete LDES">
          <intProp name="HTTPSampler.response_timeout">15000</intProp>
          <stringProp name="HTTPSampler.path">/admin/api/v1/eventstreams/observations</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">DELETE</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>